package ex03;
//오현택
public class Main {
   public static void main(String[] args) {
      //1. 클래스와 객체에 대해 작성하고 객체를 만들 때 사용되는 생성자에 대해서도 작성하세요.
      //아는 만큼 작성(최대 5줄)
	   
      //클래스 : 필드와 메소드, 생성자의 집합이다. 
	  //       이들을 포함한 설계도면이라고 할 수 있다. 아직 설계도면 가지고는 아무것도 할 수 없다.
	  //객체   : 설계도면(클래스)를 통해 실질적인 오브젝트를 만든 것을 객체라고 한다, 클래스에서 필드와 메소드를 사용할 수 있다
	  //생성자 : 필드들을 초기화할 때 사용하는 매서드형식이라고 할 수 있다. (객체를 생성할 때 호출되며 필드값을 초기화하는 역할을 한다)
	  //생성자 또한 매서드 형식으로 되어있기 때문에 오버로딩을 할 수 있다. (생성자 이름은 클래스이름과 동일하며 반환타입을 가지지 않는다)
	  //(생성자를 만들지 않으면 컴파일러가 기본 생성자를 만들게 된다)
      
   }
}
